# GetMembers Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MechanicalEquipmentSet..::..GetMembers Method
MechanicalEquipmentSet Class See Also
---
Gets member element ids for the mechanical equipment set.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public ISet<ElementId> GetMembers()
```

Visual Basic
---
```text
Public Function GetMembers As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetMembers()
```

# ### Return Value
Element ids for the members in the mechanical equipment set.
# See Also
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace